TexasInstruments/mcupsdk-core/examples/drivers/adc/adc_sw_interleaved_averaging/am263px-lp/r5fss0-0_nortos/example.syscfg
section3.load_memory             = "OCRAM";
section3.$name                   = "Code and Read-Only Data";
section3.output_section.create(2);
section3.output_section[0].$name = ".text";
section3.output_section[1].$name = ".rodata";

section4.load_memory             = "OCRAM";
section4.$name                   = "Data Segment";
section4.output_section.create(1);
section4.output_section[0].$name = ".data";

section5.load_memory                             = "OCRAM";
section5.$name                                   = "Memory Segments";
section5.output_section.create(3);
section5.output_section[0].$name                 = ".bss";
section5.output_section[0].output_sections_start = "__BSS_START";
section5.output_section[0].output_sections_end   = "__BSS_END";
section5.output_section[1].$name                 = ".sysmem";
section5.output_section[2].$name                 = ".stack";

section6.load_memory                              = "OCRAM";
section6.$name                                    = "Stack Segments";
section6.output_section.create(5);
section6.output_section[0].$name                  = ".irqstack";
section6.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section6.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section6.output_section[0].input_section.create(1);
section6.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE";
section6.output_section[1].$name                  = ".fiqstack";
section6.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section6.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section6.output_section[1].input_section.create(1);
section6.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE";
section6.output_section[2].$name                  = ".svcstack";
section6.output_section[2].output_sections_start  = "__SVC_STACK_START";
section6.output_section[2].output_sections_end    = "__SVC_STACK_END";
section6.output_section[2].input_section.create(1);
section6.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE";
section6.output_section[3].$name                  = ".abortstack";
section6.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section6.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section6.output_section[3].input_section.create(1);
section6.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE";
section6.output_section[4].$name                  = ".undefinedstack";
section6.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section6.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section6.output_section[4].input_section.create(1);
section6.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE";

section7.load_memory             = "OCRAM";
section7.$name                   = "Initialization and Exception Handling";
section7.output_section.create(3);
section7.output_section[0].$name = ".ARM.exidx";
section7.output_section[1].$name = ".init_array";
section7.output_section[2].$name = ".fini_array";

section8.load_memory             = "USER_SHM_MEM";
section8.type                    = "NOLOAD";
section8.$name                   = "User Shared Memory";
section8.group                   = false;
section8.output_section.create(1);
section8.output_section[0].$name = ".bss.user_shared_mem";

section9.load_memory             = "LOG_SHM_MEM";
section9.$name                   = "Log Shared Memory";
section9.group                   = false;
section9.output_section.create(1);
section9.output_section[0].$name = ".bss.log_shared_mem";

section10.load_memory             = "RTOS_NORTOS_IPC_SHM_MEM";
section10.type                    = "NOLOAD";
section10.$name                   = "IPC Shared Memory";
section10.group                   = false;
section10.output_section.create(1);
section10.output_section[0].$name = ".bss.ipc_vring_mem";

section11.load_memory             = "MAILBOX_HSM";
section11.type                    = "NOLOAD";
section11.$name                   = "SIPC HSM Queue Memory";
section11.group                   = false;
section11.output_section.create(1);
section11.output_section[0].$name = ".bss.sipc_hsm_queue_mem";

section12.load_memory             = "MAILBOX_R5F";
section12.$name                   = "SIPC R5F Queue Memory";
section12.group                   = false;
section12.output_section.create(1);
section12.output_section[0].$name = ".bss.sipc_r5f_queue_mem";
adc1.$name                 = "CONFIG_ADC1";
adc1.enableInterrupt1      = true;
adc1.enableInterrupt2      = true;
adc1.interrupt1SOCSource   = "ADC_SOC_NUMBER15";
adc1.interrupt2SOCSource   = "ADC_SOC_NUMBER7";
adc1.enableConverter       = true;
adc1.soc0Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc0InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc1Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc1InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc2Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc2InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc3Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc3InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc4Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc4InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc5Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc5InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc6Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc6InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc7Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc7InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc8Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc8InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc9Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc9InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc10Trigger          = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc10InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc11Trigger          = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc11InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc12Trigger          = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc12InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc13Trigger          = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc13InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc14Trigger          = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc14InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc15Trigger          = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc1.soc15InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc1.soc1Channel           = "ADC_CH_ADCIN1";
adc1.soc3Channel           = "ADC_CH_ADCIN1";
adc1.soc5Channel           = "ADC_CH_ADCIN1";
adc1.soc7Channel           = "ADC_CH_ADCIN1";
adc1.soc9Channel           = "ADC_CH_ADCIN1";
adc1.soc11Channel          = "ADC_CH_ADCIN1";
adc1.soc13Channel          = "ADC_CH_ADCIN1";
adc1.soc15Channel          = "ADC_CH_ADCIN1";
adc1.soc0SampleWindow      = 17;
adc1.soc1SampleWindow      = 17;
adc1.soc2SampleWindow      = 17;
adc1.soc3SampleWindow      = 17;
adc1.soc4SampleWindow      = 17;
adc1.soc5SampleWindow      = 17;
adc1.soc6SampleWindow      = 17;
adc1.soc7SampleWindow      = 17;
adc1.soc8SampleWindow      = 17;
adc1.soc9SampleWindow      = 17;
adc1.soc10SampleWindow     = 17;
adc1.soc11SampleWindow     = 17;
adc1.soc12SampleWindow     = 17;
adc1.soc13SampleWindow     = 17;
adc1.soc14SampleWindow     = 17;
adc1.soc15SampleWindow     = 17;
adc1.adcClockPrescaler     = "ADC_CLK_DIV_4_0";
adc1.ADC.$assign           = "ADC1";

adc2.$name                 = "CONFIG_ADC2";
adc2.enableInterrupt1      = true;
adc2.interrupt1SOCSource   = "ADC_SOC_NUMBER15";
adc2.enableConverter       = true;
adc2.soc0Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc0InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc1Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc1InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc2Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc2InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc3Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc3InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc4Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc4InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc5Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc5InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc6Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc6InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc7Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc7InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc8Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc8InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc9Trigger           = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc9InterruptTrigger  = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc10Trigger          = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc10InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc11Trigger          = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc11InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc12Trigger          = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc12InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc13Trigger          = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc13InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc14Trigger          = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc14InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc15Trigger          = "ADC_TRIGGER_INPUT_XBAR_OUT5";
adc2.soc15InterruptTrigger = "ADC_INT_SOC_TRIGGER_ADCINT1";
adc2.soc1Channel           = "ADC_CH_ADCIN1";
adc2.soc3Channel           = "ADC_CH_ADCIN1";
adc2.soc5Channel           = "ADC_CH_ADCIN1";
adc2.soc7Channel           = "ADC_CH_ADCIN1";
adc2.soc9Channel           = "ADC_CH_ADCIN1";
adc2.soc11Channel          = "ADC_CH_ADCIN1";
adc2.soc13Channel          = "ADC_CH_ADCIN1";
adc2.soc15Channel          = "ADC_CH_ADCIN1";
adc2.soc0SampleWindow      = 17;
adc2.soc1SampleWindow      = 17;
adc2.soc2SampleWindow      = 17;
adc2.soc3SampleWindow      = 17;
adc2.soc4SampleWindow      = 17;
adc2.soc5SampleWindow      = 17;
adc2.soc6SampleWindow      = 17;
adc2.soc7SampleWindow      = 17;
adc2.soc8SampleWindow      = 17;
adc2.soc9SampleWindow      = 17;
adc2.soc10SampleWindow     = 17;
adc2.soc11SampleWindow     = 17;
adc2.soc12SampleWindow     = 17;
adc2.soc13SampleWindow     = 17;
adc2.soc14SampleWindow     = 17;
adc2.soc15SampleWindow     = 17;
adc2.adcClockPrescaler     = "ADC_CLK_DIV_4_0";
adc2.ADC.$assign           = "ADC2";

gpio1.$name                = "CONFIG_GPIO_INPUT";
gpio1.GPIO.gpioPin.$assign = "EPWM13_A";

gpio2.pinDir               = "OUTPUT";
gpio2.$name                = "CONFIG_GPIO_OUTPUT";
gpio2.GPIO.gpioPin.$assign = "EPWM13_B";

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

